CSI API ETABS v1

# cAreaObjGetTransformationMatrix Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetTransformationMatrix(
    	string Name,
    	ref double[] Value,
    	bool IsGlobal = true
    )

    Function GetTransformationMatrix (
    	Name As String,
    	ByRef Value As Double(),
    	Optional IsGlobal As Boolean = true
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim Value As Double()
    Dim IsGlobal As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetTransformationMatrix(Name,
    	Value, IsGlobal)

    int GetTransformationMatrix(
    	String^ Name,
    	array<double>^% Value,
    	bool IsGlobal = true
    )

    abstract GetTransformationMatrix :
            Name : string *
            Value : float[] byref *
            ?IsGlobal : bool
    (* Defaults:
            let _IsGlobal = defaultArg IsGlobal true
    *)
    -> int

#### Parameters

Name

    Type: SystemString

Value

    Type: SystemDouble

IsGlobal (Optional)

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com